In [1]:
# Importing the necessary libraries
import pandas as pd

In [2]:

# Define the dataset
data = {
    'Customer_name': ['Oliver', 'Oliver', 'Oliver', 'Ethan', 'Ethan', 'Abigail', 'Abigail', 'Abigail', 'Abigail'],
    'Customer_id': [213, 512, 342, 413, 414, 326, 327, 348, 544],
    'New_Customer_id': [512, 342, 513, 414, 416, 327, 348, 544, 566],
    'updated_date': ['2018-06-12', '2018-09-01', '2019-03-06', '2019-05-04', '2019-09-02', '2017-02-13', '2018-05-23', '2019-09-27', '2020-04-09']
}

# Create a DataFrame from the dataset
df = pd.DataFrame(data)

In [3]:
# Having a look on data 
df.head(25)

  Customer_name  Customer_id  New_Customer_id updated_date
0        Oliver          213              512   2018-06-12
1        Oliver          512              342   2018-09-01
2        Oliver          342              513   2019-03-06
3         Ethan          413              414   2019-05-04
4         Ethan          414              416   2019-09-02
5       Abigail          326              327   2017-02-13
6       Abigail          327              348   2018-05-23
7       Abigail          348              544   2019-09-27
8       Abigail          544              566   2020-04-09

In [4]:
# Checking the data types of each column
df.dtypes

Customer_name      object
Customer_id         int64
New_Customer_id     int64
updated_date       object
dtype: object

#### Here we need to extract the latest  customer details for this we have to use date column but here date column data type is object we will convert it to data type date  which will help us to extract the latest customer details as per date

In [5]:
# Convert 'updated_date' column to datetime
df['updated_date'] = pd.to_datetime(df['updated_date'])

In [6]:
# Checking the data types again
df.dtypes

Customer_name              object
Customer_id                 int64
New_Customer_id             int64
updated_date       datetime64[ns]
dtype: object

In [16]:
# Getting the rows with the latest details for each customer
df_latest = df.loc[df.groupby('Customer_name')['updated_date'].idxmax()]

In [15]:
df_latest

  Customer_name  Customer_id  New_Customer_id updated_date
8       Abigail          544              566   2020-04-09
4         Ethan          414              416   2019-09-02
2        Oliver          342              513   2019-03-06

#### Here we are grouping by customer name we create separate groups based on the unique values in the 'Customer_name' column then using idxmax helps us to find  the index of the row with the maximum 'updated_date' value within that group .


#### Using groupby and idxmax in this way does not affect or modify other values in the dataset. It only helps us identify the indices of the rows that have the latest customer details for each customer name. The resulting indices are then used with df.loc to select and extract those specific rows from the original DataFrame.